Q1)

Five functions of pandas are:
i)reading file of html,csv format
ii)Analysing data using mean,sum etc.
iii)Using head() for filtering top data
iv) Used for value count5
v)Using drop function for altering data.

Q2)

In [2]:
import pandas as pd
data={"A":["Rajat","seth","21"],"B":["Akash","Kumar","21"],"C":["Alok","Sahu","21"]} 
df=pd.DataFrame(data,index=["x","y","z"])

In [23]:
df

       A      B     C
x  Rajat  Akash  Alok
y   seth  Kumar  Sahu
z     21     21    21

In [29]:
df.reindex(["1","3","5"],fill_value=100)

     A    B    C
1  100  100  100
3  100  100  100
5  100  100  100

Q3)

In [32]:
df1=pd.DataFrame({"Value":[10,20,30,40,50]})

In [33]:
df1

   Value
0     10
1     20
2     30
3     40
4     50

In [68]:
df1.loc[0:2].sum(axis=0)

Value    60
dtype: int64

Q4)

In [76]:
df2=pd.DataFrame({"Text":["Rajat seth","Akash","Alok kr sahoo"]})

In [77]:
df2["Word_count"]=df2["Text"].apply(lambda n:len(n.split()))

In [78]:
df2

            Text  Word_count
0     Rajat seth           2
1          Akash           1
2  Alok kr sahoo           3

Q5)

df.size() returns no. of elements in that dataframe as object whereas df.shape() returns dimension of dataframe as tuples.

Q6)

function df.read_csv is used to read function from excel file.

Q7)

In [2]:
df3=pd.DataFrame({"Email":["Rajat@gmail.com","Akash@yahoo.com"]})

In [3]:
df3

             Email
0  Rajat@gmail.com
1  Akash@yahoo.com

In [5]:
df3["Domain"]=df3["Email"].str.split("@").str[1]

In [6]:
df3

             Email     Domain
0  Rajat@gmail.com  gmail.com
1  Akash@yahoo.com  yahoo.com

Q8)

In [3]:
df4=pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,11,3,1],"C":[1,7,4,5,2]})

In [4]:
df4

   A   B  C
0  3   5  1
1  8   2  7
2  6  11  4
3  2   3  5
4  9   1  2

In [5]:
result_df=df4.loc[(df4["A"]>5)]

In [6]:
result_df

   A   B  C
1  8   2  7
2  6  11  4
4  9   1  2

Q9)

In [7]:
df5=pd.DataFrame({"Value":[1,2,3,4,5,6,7,8,9]})

In [12]:
df5.mean()

Value    5.0
dtype: float64

In [13]:
df5.median()

Value    5.0
dtype: float64

In [16]:
df5.std()

Value    2.738613
dtype: float64

Q10)

In [7]:
df6=pd.DataFrame({"Value":[5000,6000,5410,8546,4587,9542,5265,4682,4534,5343,3852,]})

In [8]:
df6

    Value
0    5000
1    6000
2    5410
3    8546
4    4587
5    9542
6    5265
7    4682
8    4534
9    5343
10   3852

In [11]:
df6["Date"]=pd.date_range(start="1/03/2023",periods=len(df6),freq="D")

In [12]:
df6

    Value       Date
0    5000 2023-01-03
1    6000 2023-01-04
2    5410 2023-01-05
3    8546 2023-01-06
4    4587 2023-01-07
5    9542 2023-01-08
6    5265 2023-01-09
7    4682 2023-01-10
8    4534 2023-01-11
9    5343 2023-01-12
10   3852 2023-01-13

In [15]:
df6["Moving_average"]=df6.rolling(7).mean()

/tmp/ipykernel_95/958894364.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df6["Moving_average"]=df6.rolling(7).mean()

In [16]:
df6

    Value       Date  Moving_average
0    5000 2023-01-03             NaN
1    6000 2023-01-04             NaN
2    5410 2023-01-05             NaN
3    8546 2023-01-06             NaN
4    4587 2023-01-07             NaN
5    9542 2023-01-08             NaN
6    5265 2023-01-09     6335.714286
7    4682 2023-01-10     6290.285714
8    4534 2023-01-11     6080.857143
9    5343 2023-01-12     6071.285714
10   3852 2023-01-13     5400.714286

Q11)

In [17]:
df6.drop(columns=["Value","Moving_average"],inplace=True)

In [18]:
df6

         Date
0  2023-01-03
1  2023-01-04
2  2023-01-05
3  2023-01-06
4  2023-01-07
5  2023-01-08
6  2023-01-09
7  2023-01-10
8  2023-01-11
9  2023-01-12
10 2023-01-13

In [27]:
df6["Weekdays"]=df6["Date"].dt.day_name()

In [28]:
df6

         Date   Weekdays
0  2023-01-03    Tuesday
1  2023-01-04  Wednesday
2  2023-01-05   Thursday
3  2023-01-06     Friday
4  2023-01-07   Saturday
5  2023-01-08     Sunday
6  2023-01-09     Monday
7  2023-01-10    Tuesday
8  2023-01-11  Wednesday
9  2023-01-12   Thursday
10 2023-01-13     Friday

Q12)

In [1]:
df6[Timestamps]=df6[]

SyntaxError: invalid syntax (3207311997.py, line 1)

Q13)

In [ ]:
Pandas is imported as pd